CORPO_ALLUNGATO/nonAttuato/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  12                                    |
|   \\  /    A nd           | Website:  www.openfoam.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut; // Viscosità turbolenta di sottogriglia
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0; // Valore iniziale (verrà calcolato da WALE)

boundaryField
{
    inlet
    {
        type            calculated;
        value           $internalField;
        // Alternativa: type zeroGradient;
    }
    outlet
    {
        type            calculated;
        value           $internalField;
        // Alternativa: type zeroGradient;
    }
    topWall
    {
        type            symmetry;
    }
    bottomWall
    {
        type            symmetry;
    }
    bodyWall 
    {
        type                fixedValue;
        value                uniform 0;  
    }
    actuatorSlot_top 
    {
        type                fixedValue; 
       value                 uniform 0; 
    }
    actuatorSlot_bottom 
    {
        type                fixedValue; 
        value                uniform 0; 
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
