CORPO_ALLUNGATO/nonAttuato/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  12                                    |
|   \\  /    A nd           | Website:  www.openfoam.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


numberOfSubdomains 12; // <-- MODIFICATO A 12

method          scotch; // Metodo di decomposizione (scotch è generalmente buono)

// Optional: Coefficients for simple/hierarchical methods
// Non servono se usi 'scotch'
// coeffs
// {
//     n           (4 2 1); // Esempio per 8 = 4 * 2 * 1
//     delta       0.001;
//     order       xyz;
// }

// ************************************************************************* //
